RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_pwr.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_ll_pwr.h
  * @author  MCD Application Team
  * @brief   Header file of PWR LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_LL_PWR_H
#define STM32H7RSxx_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx.h"

/** @addtogroup STM32H7RSxx_LL_Driver
  * @{
  */

#if defined (PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup PWR_LL_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_LL_WAKEUP_PIN_OFFSET Wake-Up Pins register offsets Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
/* Wake-Up Pins PWR register offsets */
#define LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET    (2UL)
#define LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK       (0x1FU)
/**
  * @}
  */
/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Constants PWR Exported Constants
  * @{
  */

/** @defgroup PWR_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_WriteReg function
  * @{
  */
#define LL_PWR_SR_CSSF                 PWR_CSR3_CSSF                           /*!< Clear Stop and Standby flags */
#define LL_PWR_WKUPCR_WKUPC1           PWR_WKUPCR_WKUPC1                       /*!< Clear Wakeup flag 1          */
#define LL_PWR_WKUPCR_WKUPC2           PWR_WKUPCR_WKUPC2                       /*!< Clear Wakeup flag 2          */
#define LL_PWR_WKUPCR_WKUPC3           PWR_WKUPCR_WKUPC3                       /*!< Clear Wakeup flag 3          */
#define LL_PWR_WKUPCR_WKUPC4           PWR_WKUPCR_WKUPC4                       /*!< Clear Wakeup flag 4          */
#define LL_PWR_WKUPCR_WKUPC            PWR_WKUPCR_WKUPC                        /*!< Clear all Wakeup flags       */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_PWR_ReadReg function
  * @{
  */
#define LL_PWR_FLAG_VOSRDY             PWR_CSR4_VOSRDY                         /*!< Voltage scaling ready flag */
#define LL_PWR_FLAG_STOPF              PWR_CSR3_STOPF                          /*!< Stop flag                  */
#define LL_PWR_FLAG_SBF                PWR_CSR3_SBF                            /*!< Standby flag               */
#define LL_PWR_WAKEUP_FLAG1            PWR_WKUPFR_WKUPF1                       /*!< Wakeup flag 1              */
#define LL_PWR_WAKEUP_FLAG2            PWR_WKUPFR_WKUPF2                       /*!< Wakeup flag 2              */
#define LL_PWR_WAKEUP_FLAG3            PWR_WKUPFR_WKUPF3                       /*!< Wakeup flag 3              */
#define LL_PWR_WAKEUP_FLAG4            PWR_WKUPFR_WKUPF4                       /*!< Wakeup flag 4              */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_MODE_PWR Power Down Mode In Deep Sleep Mode
  * @{
  */
#define LL_PWR_POWERDOWN_MODE_DS_STOP     (0U)                                 /*!< Enter to Stop mode when the CPU enters deepsleep    */
#define LL_PWR_POWERDOWN_MODE_DS_STANDBY  PWR_CSR3_PDDS                        /*!< Enter to Standby mode when the CPU enters deepsleep */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_REGU_VOLTAGE Run mode Regulator Voltage Scaling
  * @{
  */
#define LL_PWR_REGU_VOLTAGE_SCALE0     PWR_CSR4_VOS                            /*!< Voltage scaling range 0 (highest frequency) */
#define LL_PWR_REGU_VOLTAGE_SCALE1     (0U)                                    /*!< Voltage scaling range 1 (lowest power)      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_STOP_MODE_REGU_VOLTAGE Stop mode Regulator Voltage Scaling
  * @{
  */
#define LL_PWR_REGU_STOP_VOLTAGE_SCALE3     PWR_CR1_SVOS                       /*!< Voltage scaling range 3 (highest frequency) when system enters STOP mode */
#define LL_PWR_REGU_STOP_VOLTAGE_SCALE5     (0U)                               /*!< Voltage scaling range 5 (lowest power) when system enters STOP mode      */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PVDLEVEL Power Digital Voltage Level Detector
  * @{
  */
#define LL_PWR_PVDLEVEL_1              (0U)                                    /*!< PVD level 1 */
#define LL_PWR_PVDLEVEL_2              PWR_CR1_PLS_0                           /*!< PVD level 2 */
#define LL_PWR_PVDLEVEL_3              PWR_CR1_PLS_1                           /*!< PVD level 3 */
#define LL_PWR_PVDLEVEL_4              (PWR_CR1_PLS_0 | PWR_CR1_PLS_1)         /*!< PVD level 4 */
#define LL_PWR_PVDLEVEL_5              PWR_CR1_PLS_2                           /*!< PVD level 5 */
#define LL_PWR_PVDLEVEL_6              (PWR_CR1_PLS_0 | PWR_CR1_PLS_2)         /*!< PVD level 6 */
#define LL_PWR_PVDLEVEL_7              (PWR_CR1_PLS_1 | PWR_CR1_PLS_2)         /*!< PVD level 7 */
#define LL_PWR_PVDLEVEL_EXT            (PWR_CR1_PLS_0 | PWR_CR1_PLS_1 | PWR_CR1_PLS_2)
/*!< External voltage level on PVD_IN pin, compared to internal VREFINT level */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_AVDLEVEL Power Analog Voltage Level Detector
  * @{
  */
#define LL_PWR_AVDLEVEL_1              (0U)                                    /*!< Analog Voltage detector level 1 */
#define LL_PWR_AVDLEVEL_2              PWR_CR1_ALS_0                           /*!< Analog Voltage detector level 2 */
#define LL_PWR_AVDLEVEL_3              PWR_CR1_ALS_1                           /*!< Analog Voltage detector level 3 */
#define LL_PWR_AVDLEVEL_4              (PWR_CR1_ALS_0 | PWR_CR1_ALS_1)         /*!< Analog Voltage detector level 4 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_XSPI_CAP1 XSPI 1 capacitor
  * @{
  */
#define LL_PWR_XSPI1_CAPACITOR_OFF     (0U)                                    /*!< XSPI Port 1 Capacitor OFF        */
#define LL_PWR_XSPI1_CAPACITOR_1_DIV_3 PWR_CSR2_XSPICAP1_0                     /*!< XSPI Port 1 Capacitor set to 1/3 */
#define LL_PWR_XSPI1_CAPACITOR_2_DIV_3 PWR_CSR2_XSPICAP1_1                     /*!< XSPI Port 1 Capacitor set to 2/3 */
#define LL_PWR_XSPI1_CAPACITOR_FULL    (PWR_CSR2_XSPICAP1_0 | PWR_CSR2_XSPICAP1_1)
/*!< XSPI Port 1 Capacitor set to full capacitance */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_XSPI_CAP2 XSPI 2 Capacitor
  * @{
  */
#define LL_PWR_XSPI2_CAPACITOR_OFF     (0U)                                    /*!< XSPI Port 2 Capacitor OFF        */
#define LL_PWR_XSPI2_CAPACITOR_1_DIV_3 PWR_CSR2_XSPICAP2_0                     /*!< XSPI Port 2 Capacitor set to 1/3 */
#define LL_PWR_XSPI2_CAPACITOR_2_DIV_3 PWR_CSR2_XSPICAP2_1                     /*!< XSPI Port 2 Capacitor set to 2/3 */
#define LL_PWR_XSPI2_CAPACITOR_FULL    (PWR_CSR2_XSPICAP2_0 | PWR_CSR2_XSPICAP2_1)
/*!< XSPI Port 2 Capacitor set to full capacitance */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_BATT_CHARG_RESISTOR Battery Charge Resistor
  * @{
  */
#define LL_PWR_BATT_CHARG_RESISTOR_5K   (0U)                                   /*!< Charge the Battery through a 5 kO resistor   */
#define LL_PWR_BATT_CHARG_RESISTOR_1_5K PWR_CSR2_VBRS                          /*!< Charge the Battery through a 1.5 kO resistor */
/**
  * @}
  */

