RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_pwr.h
/** @defgroup PWR_LL_EC_WAKEUP_PIN  Wakeup Pins
  * @{
  */
#define LL_PWR_WAKEUP_PIN1             PWR_WKUPEPR_WKUPEN1                     /*!< Wake-Up pin 1 : PA0  */
#define LL_PWR_WAKEUP_PIN2             PWR_WKUPEPR_WKUPEN2                     /*!< Wake-Up pin 2 : PA2  */
#define LL_PWR_WAKEUP_PIN3             PWR_WKUPEPR_WKUPEN3                     /*!< Wake-Up pin 3 : PC13 */
#define LL_PWR_WAKEUP_PIN4             PWR_WKUPEPR_WKUPEN4                     /*!< Wake-Up pin 4 : PC1  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN_PULL  Wakeup Pins pull configuration
  * @{
  */
#define LL_PWR_WAKEUP_PIN_NOPULL       (0UL)                                   /*!< Configure Wake-Up pin in no pull   */
#define LL_PWR_WAKEUP_PIN_PULLUP       (1UL)                                   /*!< Configure Wake-Up pin in pull Up   */
#define LL_PWR_WAKEUP_PIN_PULLDOWN     (2UL)                                   /*!< Configure Wake-Up pin in pull Down */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SUPPLY_PWR Power supply source configuration
  * @{
  */
#define LL_PWR_LDO_SUPPLY                     PWR_CSR2_LDOEN                                                              /*!< Core domains are supplied from the LDO                                                                      */
#define LL_PWR_DIRECT_SMPS_SUPPLY             PWR_CSR2_SDEN                                                               /*!< Core domains are supplied from the SMPS                                                                     */
#define LL_PWR_SMPS_1V8_SUPPLIES_LDO          (PWR_CSR2_SDHILEVEL | PWR_CSR2_SDEN | PWR_CSR2_LDOEN)                       /*!< The SMPS 1.8V output supplies the LDO which supplies the Core domains                                       */
#define LL_PWR_SMPS_1V8_SUPPLIES_EXT_AND_LDO  (PWR_CSR2_SDHILEVEL | PWR_CSR2_SMPSEXTHP | PWR_CSR2_SDEN | PWR_CSR2_LDOEN)  /*!< The SMPS 1.8V output supplies an external circuits and the LDO. The Core domains are supplied from the LDO  */
#define LL_PWR_SMPS_1V8_SUPPLIES_EXT          (PWR_CSR2_SDHILEVEL | PWR_CSR2_SMPSEXTHP | PWR_CSR2_SDEN | PWR_CSR2_BYPASS) /*!< The SMPS 1.8V output supplies an external source which supplies the Core domains                            */
#define LL_PWR_EXTERNAL_SOURCE_SUPPLY         PWR_CSR2_BYPASS                                                             /*!< The SMPS and the LDO are Bypassed. The Core domains are supplied from an external source                    */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_GPIO_PIN_MASK PWR GPIO Pin Mask
  * @{
  */
#define LL_PWR_GPIO_PIN_0              (0x0001U)                               /*!< GPIO port I/O pin 0  */
#define LL_PWR_GPIO_PIN_1              (0x0002U)                               /*!< GPIO port I/O pin 1  */
#define LL_PWR_GPIO_PIN_2              (0x0004U)                               /*!< GPIO port I/O pin 2  */
#define LL_PWR_GPIO_PIN_3              (0x0008U)                               /*!< GPIO port I/O pin 3  */
#define LL_PWR_GPIO_PIN_4              (0x0010U)                               /*!< GPIO port I/O pin 4  */
#define LL_PWR_GPIO_PIN_5              (0x0020U)                               /*!< GPIO port I/O pin 5  */
#define LL_PWR_GPIO_PIN_6              (0x0040U)                               /*!< GPIO port I/O pin 6  */
#define LL_PWR_GPIO_PIN_7              (0x0080U)                               /*!< GPIO port I/O pin 7  */
#define LL_PWR_GPIO_PIN_8              (0x0100U)                               /*!< GPIO port I/O pin 8  */
#define LL_PWR_GPIO_PIN_9              (0x0200U)                               /*!< GPIO port I/O pin 9  */
#define LL_PWR_GPIO_PIN_10             (0x0400U)                               /*!< GPIO port I/O pin 10 */
#define LL_PWR_GPIO_PIN_11             (0x0800U)                               /*!< GPIO port I/O pin 11 */
#define LL_PWR_GPIO_PIN_12             (0x1000U)                               /*!< GPIO port I/O pin 12 */
#define LL_PWR_GPIO_PIN_13             (0x2000U)                               /*!< GPIO port I/O pin 13 */
#define LL_PWR_GPIO_PIN_14             (0x4000U)                               /*!< GPIO port I/O pin 14 */
#define LL_PWR_GPIO_PIN_15             (0x8000U)                               /*!< GPIO port I/O pin 15 */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Macros PWR Exported Macros
  * @{
  */

/** @defgroup PWR_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_PWR_WriteReg(__REG__, __VALUE__) WRITE_REG(PWR->__REG__, (__VALUE__))

/**
  * @brief  Read a value in PWR register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_PWR_ReadReg(__REG__) READ_REG(PWR->__REG__)
/**
  * @}
  */

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @defgroup PWR_LL_Exported_Functions PWR Exported Functions
  * @{
  */

/** @defgroup PWR_LL_EF_Configuration PWR Configuration
  * @{
  */

/**
  * @brief  Enable Power Voltage Detector
  * @rmtoll CR1        PVDE            LL_PWR_EnablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_PVDE);
}

/**
  * @brief  Disable Power Voltage Detector
  * @rmtoll CR1        PVDE            LL_PWR_DisablePVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_PVDE);
}

/**
  * @brief  Check if Power Voltage Detector is enabled
  * @rmtoll CR1        PVDE            LL_PWR_IsEnabledPVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_PVDE) == (PWR_CR1_PVDE)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the voltage threshold detected by the Power Voltage Detector
  * @rmtoll CR1        PLS             LL_PWR_SetPVDLevel
  * @param  PVDLevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  *         @arg @ref LL_PWR_PVDLEVEL_EXT
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPVDLevel(uint32_t PVDLevel)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_PLS, PVDLevel);
}

/**
  * @brief  Get the voltage threshold detection
  * @rmtoll CR1        PLS             LL_PWR_GetPVDLevel
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_PVDLEVEL_1
  *         @arg @ref LL_PWR_PVDLEVEL_2
  *         @arg @ref LL_PWR_PVDLEVEL_3
  *         @arg @ref LL_PWR_PVDLEVEL_4
  *         @arg @ref LL_PWR_PVDLEVEL_5
  *         @arg @ref LL_PWR_PVDLEVEL_6
  *         @arg @ref LL_PWR_PVDLEVEL_7
  *         @arg @ref LL_PWR_PVDLEVEL_EXT
  */
__STATIC_INLINE uint32_t LL_PWR_GetPVDLevel(void)
{
  return READ_BIT(PWR->CR1, PWR_CR1_PLS);
}

/**
  * @brief  Enable access to the backup domain
  * @rmtoll CR1        DBP             LL_PWR_EnableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkUpAccess(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @brief  Disable access to the backup domain
  * @rmtoll CR1        DBP             LL_PWR_DisableBkUpAccess
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkUpAccess(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @brief  Check if the backup domain is enabled
  * @rmtoll CR1        DBP             LL_PWR_IsEnabledBkUpAccess
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpAccess(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_DBP) == (PWR_CR1_DBP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Flash low-power mode in Stop Mode
  * @rmtoll CR1        FLPS            LL_PWR_EnableFlashLowPower
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableFlashLowPower(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_FLPS);
}

/**
  * @brief  Disable the Flash low-power mode in Stop Mode
  * @rmtoll CR1        FLPS            LL_PWR_DisableFlashLowPower
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableFlashLowPower(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_FLPS);
}

/**
  * @brief  Check if the Flash low-power mode in Stop Mode is enabled
  * @rmtoll CR1        FLPS            LL_PWR_IsEnabledFlashLowPower
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFlashLowPower(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_FLPS) == (PWR_CR1_FLPS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Analog Voltage Booster
  * @rmtoll CR1        BOOSTE          LL_PWR_EnableAnalogBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableAnalogBooster(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_BOOSTE);
}

/**
  * @brief  Disable the Analog Voltage Booster
  * @rmtoll CR1        BOOSTE          LL_PWR_DisableAnalogBooster
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableAnalogBooster(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_BOOSTE);
}

/**
  * @brief  Check if the Analog Voltage Booster is enabled
  * @rmtoll CR1        BOOSTE          LL_PWR_IsEnabledAnalogBooster
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledAnalogBooster(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_BOOSTE) == (PWR_CR1_BOOSTE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Analog Voltage Ready
  * @rmtoll CR1        AVDREADY        LL_PWR_EnableAnalogVoltageReady
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableAnalogVoltageReady(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_AVDREADY);
}

/**
  * @brief  Disable the Analog Voltage Ready
  * @rmtoll CR1        AVDREADY        LL_PWR_DisableAnalogVoltageReady
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableAnalogVoltageReady(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_AVDREADY);
}

/**
  * @brief  Check if the Analog Voltage Ready is enabled
  * @rmtoll CR1        AVDREADY        LL_PWR_IsEnabledAnalogVoltageReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledAnalogVoltageReady(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_AVDREADY) == (PWR_CR1_AVDREADY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Analog Power Voltage Monitor
  * @rmtoll CR1        AVDEN           LL_PWR_EnableAVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableAVD(void)
{
  SET_BIT(PWR->CR1, PWR_CR1_AVDEN);
}

/**
  * @brief  Disable Analog Power Voltage Monitor
  * @rmtoll CR1        AVDEN           LL_PWR_DisableAVD
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableAVD(void)
{
  CLEAR_BIT(PWR->CR1, PWR_CR1_AVDEN);
}

/**
  * @brief  Check if Analog Power Voltage Monitor is enabled
  * @rmtoll CR1        AVDEN           LL_PWR_IsEnabledAVD
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledAVD(void)
{
  return ((READ_BIT(PWR->CR1, PWR_CR1_AVDEN) == (PWR_CR1_AVDEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Analog Voltage detector level
  * @rmtoll CR1        ALS             LL_PWR_SetAVDLevel
  * @param  AVDLevel This parameter can be one of the following values:
  *         @arg @ref LL_PWR_AVDLEVEL_1
  *         @arg @ref LL_PWR_AVDLEVEL_2
  *         @arg @ref LL_PWR_AVDLEVEL_3
  *         @arg @ref LL_PWR_AVDLEVEL_4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetAVDLevel(uint32_t AVDLevel)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_ALS, AVDLevel);
}

/**
  * @brief  Get the Analog Voltage detector level selected
  * @rmtoll CR1        ALS             LL_PWR_GetAVDLevel
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_AVDLEVEL_1
  *         @arg @ref LL_PWR_AVDLEVEL_2
  *         @arg @ref LL_PWR_AVDLEVEL_3
  *         @arg @ref LL_PWR_AVDLEVEL_4
  */
__STATIC_INLINE uint32_t LL_PWR_GetAVDLevel(void)
{
  return READ_BIT(PWR->CR1, PWR_CR1_ALS);
}

/**
  * @brief  Enable Backup Regulator
  * @rmtoll CSR1       BREN            LL_PWR_EnableBkUpRegulator
  * @note When set, the Backup Regulator (used to maintain backup SRAM content in Standby and
  *       VBAT modes) is enabled. If BRE is reset, the backup Regulator is switched off. The backup
  *       SRAM can still be used but its content will be lost in the Standby and VBAT modes. Once set,
  *       the application must wait that the Backup Regulator Ready flag (BRR) is set to indicate that
  *       the data written into the RAM will be maintained in the Standby and VBAT modes.
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBkUpRegulator(void)
{
  SET_BIT(PWR->CSR1, PWR_CSR1_BREN);
}

/**
  * @brief  Disable Backup Regulator
  * @rmtoll CSR1       BREN            LL_PWR_DisableBkUpRegulator
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBkUpRegulator(void)
{
  CLEAR_BIT(PWR->CSR1, PWR_CSR1_BREN);
}

/**
  * @brief  Check if the backup Regulator is enabled
  * @rmtoll CSR1       BREN            LL_PWR_IsEnabledBkUpRegulator
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBkUpRegulator(void)
{
  return ((READ_BIT(PWR->CSR1, PWR_CSR1_BREN) == (PWR_CSR1_BREN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable VBAT and Temperature monitoring
  * @rmtoll CSR1       MONEN           LL_PWR_EnableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableMonitoring(void)
{
  SET_BIT(PWR->CSR1, PWR_CSR1_MONEN);
}

/**
  * @brief  Disable VBAT and Temperature monitoring
  * @rmtoll CSR1       MONEN           LL_PWR_DisableMonitoring
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableMonitoring(void)
{
  CLEAR_BIT(PWR->CSR1, PWR_CSR1_MONEN);
}

/**
  * @brief  Check if the VBAT and Temperature monitoring is enabled
  * @rmtoll CSR1       MONEN           LL_PWR_IsEnabledMonitoring
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledMonitoring(void)
{
  return ((READ_BIT(PWR->CSR1, PWR_CSR1_MONEN) == (PWR_CSR1_MONEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the PWR supply
  * @rmtoll CSR2       SDHILEVEL       LL_PWR_ConfigSupply
  * @rmtoll CSR2       SMPSEXTHP       LL_PWR_ConfigSupply
  * @rmtoll CSR2       SDEN            LL_PWR_ConfigSupply
  * @rmtoll CSR2       LDOEN           LL_PWR_ConfigSupply
  * @rmtoll CSR2       BYPASS          LL_PWR_ConfigSupply
  * @param  SupplySource This parameter can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_DIRECT_SMPS_SUPPLY
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_LDO
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_EXT_AND_LDO
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_EXT
  *         @arg @ref LL_PWR_EXTERNAL_SOURCE_SUPPLY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_ConfigSupply(uint32_t SupplySource)
{
  /* Set the power supply configuration */
  MODIFY_REG(PWR->CSR2, (PWR_CSR2_SDHILEVEL | PWR_CSR2_SMPSEXTHP | PWR_CSR2_SDEN | PWR_CSR2_LDOEN | PWR_CSR2_BYPASS),
             SupplySource);
}

/**
  * @brief  Get the PWR supply
  * @rmtoll CSR2       SDHILEVEL       LL_PWR_GetSupply
  * @rmtoll CSR2       SMPSEXTHP       LL_PWR_GetSupply
  * @rmtoll CSR2       SDEN            LL_PWR_GetSupply
  * @rmtoll CSR2       LDOEN           LL_PWR_GetSupply
  * @rmtoll CSR2       BYPASS          LL_PWR_GetSupply
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_LDO_SUPPLY
  *         @arg @ref LL_PWR_DIRECT_SMPS_SUPPLY
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_LDO
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_EXT_AND_LDO
  *         @arg @ref LL_PWR_SMPS_1V8_SUPPLIES_EXT
  *         @arg @ref LL_PWR_EXTERNAL_SOURCE_SUPPLY
  */
__STATIC_INLINE uint32_t LL_PWR_GetSupply(void)
{
  /* Get the power supply configuration */
  return READ_BIT(PWR->CSR2,
                  (PWR_CSR2_SDHILEVEL | PWR_CSR2_SMPSEXTHP | PWR_CSR2_SDEN | PWR_CSR2_LDOEN | PWR_CSR2_BYPASS));
}

/**
  * @brief  Enable VBAT battery charging
  * @rmtoll CSR2       VBE             LL_PWR_EnableBatteryCharging
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableBatteryCharging(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_VBE);
}

/**
  * @brief  Disable VBAT battery charging
  * @rmtoll CSR2       VBE             LL_PWR_DisableBatteryCharging
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableBatteryCharging(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_VBE);
}

/**
  * @brief  Check if VBAT battery charging is enabled
  * @rmtoll CSR2       VBE             LL_PWR_IsEnabledBatteryCharging
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledBatteryCharging(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_VBE) == (PWR_CSR2_VBE)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Battery charge resistor impedance
  * @rmtoll CSR2       VBRS            LL_PWR_SetBattChargResistor
  * @param  Resistor This parameter can be one of the following values:
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_5K
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_1_5K
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetBattChargResistor(uint32_t Resistor)
{
  MODIFY_REG(PWR->CSR2, PWR_CSR2_VBRS, Resistor);
}

/**
  * @brief  Get the Battery charge resistor impedance
  * @rmtoll CSR2       VBRS            LL_PWR_GetBattChargResistor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_5K
  *         @arg @ref LL_PWR_BATT_CHARG_RESISTOR_1_5K
  */
__STATIC_INLINE uint32_t LL_PWR_GetBattChargResistor(void)
{
  return (READ_BIT(PWR->CSR2, PWR_CSR2_VBRS));
}

/**
  * @brief  Set the XSPI port 1 capacitor value
  * @rmtoll CSR2       XSPICAP1        LL_PWR_SetXSPI1Capacitor
  * @param  Capacitor This parameter can be one of the following values:
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_OFF
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_1_DIV_3
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_2_DIV_3
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_FULL
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetXSPI1Capacitor(uint32_t Capacitor)
{
  MODIFY_REG(PWR->CSR2, PWR_CSR2_XSPICAP1, Capacitor);
}

/**
  * @brief  Get the XSPI port 1 capacitor value
  * @rmtoll CSR2       XSPICAP1        LL_PWR_GetXSPI1Capacitor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_OFF
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_1_DIV_3
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_2_DIV_3
  *         @arg @ref LL_PWR_XSPI1_CAPACITOR_FULL
  */
__STATIC_INLINE uint32_t LL_PWR_GetXSPI1Capacitor(void)
{
  return (READ_BIT(PWR->CSR2, PWR_CSR2_XSPICAP1));
}

/**
  * @brief  Set the XSPI port 2 capacitor value
  * @rmtoll CSR2       XSPICAP2        LL_PWR_SetXSPI2Capacitor
  * @param  Capacitor This parameter can be one of the following values:
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_OFF
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_1_DIV_3
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_2_DIV_3
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_FULL
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetXSPI2Capacitor(uint32_t Capacitor)
{
  MODIFY_REG(PWR->CSR2, PWR_CSR2_XSPICAP2, Capacitor);
}

/**
  * @brief  Get the XSPI port 2 capacitor value
  * @rmtoll CSR2       XSPICAP2        LL_PWR_GetXSPI2Capacitor
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_OFF
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_1_DIV_3
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_2_DIV_3
  *         @arg @ref LL_PWR_XSPI2_CAPACITOR_FULL
  */
__STATIC_INLINE uint32_t LL_PWR_GetXSPI2Capacitor(void)
{
  return (uint32_t)(READ_BIT(PWR->CSR2, PWR_CSR2_XSPICAP2));
}

/**
  * @brief  Enable the USB voltage detector
  * @rmtoll CSR2       USB33DEN        LL_PWR_EnableUSBVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBVoltageDetector(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_USB33DEN);
}

/**
  * @brief  Disable the USB voltage detector
  * @rmtoll CSR2       USB33DEN        LL_PWR_DisableUSBVoltageDetector
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBVoltageDetector(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_USB33DEN);
}

/**
  * @brief  Check if the USB voltage detector is enabled
  * @rmtoll CSR2       USB33DEN        LL_PWR_IsEnabledUSBVoltageDetector
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBVoltageDetector(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_USB33DEN) == (PWR_CSR2_USB33DEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the USB regulator
  * @rmtoll CSR2       USBREGEN        LL_PWR_EnableUSBReg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBReg(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_USBREGEN);
}

/**
  * @brief  Disable the USB regulator
  * @rmtoll CSR2       USBREGEN        LL_PWR_DisableUSBReg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBReg(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_USBREGEN);
}

/**
  * @brief  Check if the USB regulator is enabled
  * @rmtoll CSR2       USBREGEN        LL_PWR_IsEnabledUSBReg
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBReg(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_USBREGEN) == (PWR_CSR2_USBREGEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the USB HS PHY regulator
  * @rmtoll CSR2       USBHSREGEN      LL_PWR_EnableUSBHSPHYReg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUSBHSPHYReg(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_USBHSREGEN);
}

/**
  * @brief  Disable USB HS PHY regulator
  * @rmtoll CSR2       USBHSREGEN      LL_PWR_DisableUSBHSPHYReg
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUSBHSPHYReg(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_USBHSREGEN);
}

/**
  * @brief  Check if the USB HS PHY regulator is enabled
  * @rmtoll CSR2       USBHSREGEN      LL_PWR_IsEnabledUSBHSPHYReg
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUSBHSPHYReg(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_USBHSREGEN) == (PWR_CSR2_USBHSREGEN)) ? 1UL : 0UL);
}

/**
  * @brief Enable UCPD configuration memorization in Standby.
  * @rmtoll UCPDR      UCPD_STBY       LL_PWR_EnableUCPDStandbyMode
  * @retval None
  * @note  This function must be called just before entering Standby mode when using UCPD.
  */
__STATIC_INLINE void LL_PWR_EnableUCPDStandbyMode(void)
{
  /* Memorize UCPD configuration when entering standby mode */
  SET_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_STBY);
}

/**
  * @brief Disable UCPD configuration memorization in Standby.
  * @rmtoll UCPDR      UCPD_STBY       LL_PWR_DisableUCPDStandbyMode
  * @retval None
  * @note  This function must be called on exiting the Standby mode and before any UCPD
  *        configuration update.
  */
__STATIC_INLINE void LL_PWR_DisableUCPDStandbyMode(void)
{
  CLEAR_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_STBY);
}

/**
  * @brief  Check if the UCPD configuration memorization in Standby is enabled
  * @rmtoll UCPDR      UCPD_STBY       LL_PWR_IsEnabledUCPDStandbyMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUCPDStandbyMode(void)
{
  return ((READ_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_STBY) == (PWR_UCPDR_UCPD_STBY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the UCPD dead battery behavior
  * @rmtoll UCPDR       UCPD_DBDIS      LL_PWR_EnableUCPDDeadBattery
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableUCPDDeadBattery(void)
{
  CLEAR_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_DBDIS);
}

/**
  * @brief  Disable the UCPD dead battery behavior
  * @rmtoll UCPDR       UCPD_DBDIS      LL_PWR_DisableUCPDDeadBattery
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableUCPDDeadBattery(void)
{
  SET_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_DBDIS);
}

