RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_pwr.h
/**
  * @brief  Check if the UCPD dead battery behavior is enabled
  * @rmtoll UCPDR       UCPD_DBDIS      LL_PWR_IsEnabledUCPDDeadBattery
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledUCPDDeadBattery(void)
{
  return ((READ_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_DBDIS) == (PWR_UCPDR_UCPD_DBDIS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the XSPI_P1 interface
  * @rmtoll CSR2       EN_XSPIM1      LL_PWR_EnableXSPIM1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableXSPIM1(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM1);
}

/**
  * @brief  Disable the XSPI_P1 interface
  * @rmtoll CSR2       EN_XSPIM1      LL_PWR_DisableXSPIM1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableXSPIM1(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM1);
}

/**
  * @brief  Check if the XSPI_P1 interface is enabled
  * @rmtoll CSR2       EN_XSPIM1      LL_PWR_IsEnabledXSPIM1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledXSPIM1(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM1) == (PWR_CSR2_EN_XSPIM1)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the XSPI_P2 interface
  * @rmtoll CSR2       EN_XSPIM2      LL_PWR_EnableXSPIM2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableXSPIM2(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM2);
}

/**
  * @brief  Disable the XSPI_P2 interface
  * @rmtoll CSR2       EN_XSPIM2      LL_PWR_DisableXSPIM2
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableXSPIM2(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM2);
}

/**
  * @brief  Check if the XSPI_P2 interface is enabled
  * @rmtoll CSR2       EN_XSPIM2      LL_PWR_IsEnabledXSPIM2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledXSPIM2(void)
{
  return ((READ_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM2) == (PWR_CSR2_EN_XSPIM2)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Power Down mode when device enters deepsleep mode
  * @rmtoll CSR3       PDDS            LL_PWR_SetPowerDownModeDS
  * @param  PDMode This parameter can be one of the following values:
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STOP
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STANDBY
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetPowerDownModeDS(uint32_t PDMode)
{
  MODIFY_REG(PWR->CSR3, PWR_CSR3_PDDS, PDMode);
}

/**
  * @brief  Get the Power Down mode when device enters deepsleep mode
  * @rmtoll CSR3       PDDS            LL_PWR_GetPowerDownModeDS
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STOP
  *         @arg @ref LL_PWR_POWERDOWN_MODE_DS_STANDBY
  */
__STATIC_INLINE uint32_t LL_PWR_GetPowerDownModeDS(void)
{
  return (uint32_t)(READ_BIT(PWR->CSR3, PWR_CSR3_PDDS));
}

/**
  * @brief  Set the main internal Regulator output voltage
  * @rmtoll CSR4       VOS             LL_PWR_SetRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE0
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->CSR4, PWR_CSR4_VOS, VoltageScaling);
}

/**
  * @brief  Get the main internal Regulator output voltage
  * @rmtoll CSR4       VOS             LL_PWR_GetRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE0
  *         @arg @ref LL_PWR_REGU_VOLTAGE_SCALE1
  */
__STATIC_INLINE uint32_t LL_PWR_GetRegulVoltageScaling(void)
{
  return (uint32_t)(READ_BIT(PWR->CSR4, PWR_CSR4_VOS));
}

/**
  * @brief  Set the internal Regulator output voltage in STOP mode
  * @rmtoll CR1        SVOS            LL_PWR_SetStopModeRegulVoltageScaling
  * @param  VoltageScaling This parameter can be one of the following values:
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE3
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE5
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetStopModeRegulVoltageScaling(uint32_t VoltageScaling)
{
  MODIFY_REG(PWR->CR1, PWR_CR1_SVOS, VoltageScaling);
}

/**
  * @brief  Get the internal Regulator output voltage in STOP mode
  * @rmtoll CR1        SVOS            LL_PWR_GetStopModeRegulVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE3
  *         @arg @ref LL_PWR_REGU_STOP_VOLTAGE_SCALE5
  */
__STATIC_INLINE uint32_t LL_PWR_GetStopModeRegulVoltageScaling(void)
{
  return READ_BIT(PWR->CR1, PWR_CR1_SVOS);
}

/**
  * @brief  Enable the WakeUp PINx functionality
  * @rmtoll WKUPEPR    WKUPEN1         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN2         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN3         LL_PWR_EnableWakeUpPin\n
  *         WKUPEPR    WKUPEN4         LL_PWR_EnableWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin(uint32_t WakeUpPin)
{
  SET_BIT(PWR->WKUPEPR, WakeUpPin);
}

/**
  * @brief  Disable the WakeUp PINx functionality
  * @rmtoll WKUPEPR   WKUPEN1          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN2          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN3          LL_PWR_DisableWakeUpPin\n
  *         WKUPEPR   WKUPEN4          LL_PWR_DisableWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->WKUPEPR, WakeUpPin);
}

/**
  * @brief  Check if the WakeUp PINx functionality is enabled
  * @rmtoll WKUPEPR    WKUPEN1         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN2         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN3         LL_PWR_IsEnabledWakeUpPin\n
  *         WKUPEPR    WKUPEN4         LL_PWR_IsEnabledWakeUpPin
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin(uint32_t WakeUpPin)
{
  return ((READ_BIT(PWR->WKUPEPR, WakeUpPin) == (WakeUpPin)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin polarity low for the event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP2          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP3          LL_PWR_SetWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP4          LL_PWR_SetWakeUpPinPolarityLow
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  SET_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos));
}

/**
  * @brief  Set the Wake-Up pin polarity high for the event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP2          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP3          LL_PWR_SetWakeUpPinPolarityHigh\n
  *         WKUPEPR    WKUPP4          LL_PWR_SetWakeUpPinPolarityHigh
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t WakeUpPin)
{
  CLEAR_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos));
}

/**
  * @brief  Check if the Wake-Up pin polarity is low for event detection
  * @rmtoll WKUPEPR    WKUPP1          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP2          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP3          LL_PWR_IsWakeUpPinPolarityLow\n
  *         WKUPEPR    WKUPP4          LL_PWR_IsWakeUpPinPolarityLow
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsWakeUpPinPolarityLow(uint32_t WakeUpPin)
{
  return ((READ_BIT(PWR->WKUPEPR, (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos)) == (WakeUpPin << PWR_WKUPEPR_WKUPP1_Pos)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin Pull None
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullNone\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullNone
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullNone(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_NOPULL << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin Pull Up
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullUp\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullUp
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullUp(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_PULLUP << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin Pull Down
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_SetWakeUpPinPullDown\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_SetWakeUpPinPullDown
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval None
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullDown(uint32_t WakeUpPin)
{
  MODIFY_REG(PWR->WKUPEPR, \
             (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)), \
             (LL_PWR_WAKEUP_PIN_PULLDOWN << ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Get the Wake-Up pin pull
  * @rmtoll WKUPEPR    WKUPPUPD1       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD2       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD3       LL_PWR_GetWakeUpPinPull\n
  *         WKUPEPR    WKUPPUPD4       LL_PWR_GetWakeUpPinPull\
  * @param  WakeUpPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN1
  *         @arg @ref LL_PWR_WAKEUP_PIN2
  *         @arg @ref LL_PWR_WAKEUP_PIN3
  *         @arg @ref LL_PWR_WAKEUP_PIN4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_NOPULL
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLUP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULLDOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPinPull(uint32_t WakeUpPin)
{
  uint32_t regValue = READ_BIT(PWR->WKUPEPR, (PWR_WKUPEPR_WKUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin)) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));

  return (uint32_t)(regValue >> ((PWR_WKUPEPR_WKUPPUPD1_Pos + (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * POSITION_VAL(WakeUpPin))) & LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK));
}

/**
  * @brief  Enable the pull-up on I3C1_SCL (PB6)) in standby mode
  * @rmtoll APCR       I3CPB6_PU       LL_PWR_EnableI3CPB6PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableI3CPB6PU(void)
{
  SET_BIT(PWR->APCR, PWR_APCR_I3CPB6_PU);
}

/**
  * @brief  Disable the pull-up on I3C1_SCL (PB6) in standby mode
  * @rmtoll APCR       I3CPB6_PU       LL_PWR_DisableI3CPB6PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableI3CPB6PU(void)
{
  CLEAR_BIT(PWR->APCR, PWR_APCR_I3CPB6_PU);
}

/**
  * @brief  Check if the pull-up on I3C1_SCL (PB6) in standby mode is enabled
  * @rmtoll APCR       I3CPB6_PU       LL_PWR_IsEnabledI3CPB6PU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledI3CPB6PU(void)
{
  return ((READ_BIT(PWR->APCR, PWR_APCR_I3CPB6_PU) == (PWR_APCR_I3CPB6_PU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the pull-up on I3C1_SDA (PB7) in standby mode
  * @rmtoll APCR       I3CPB7_PU       LL_PWR_EnableI3CPB7PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableI3CPB7PU(void)
{
  SET_BIT(PWR->APCR, PWR_APCR_I3CPB7_PU);
}

/**
  * @brief  Disable the pull-up on I3C1_SDA (PB7) in standby mode
  * @rmtoll APCR       I3CPB7_PU       LL_PWR_DisableI3CPB7PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableI3CPB7PU(void)
{
  CLEAR_BIT(PWR->APCR, PWR_APCR_I3CPB7_PU);
}

/**
  * @brief  Check if the pull-up on I3C1_SDA (PB7) in standby mode is enabled
  * @rmtoll APCR       I3CPB7_PU       LL_PWR_IsEnabledI3CPB7PU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledI3CPB7PU(void)
{
  return ((READ_BIT(PWR->APCR, PWR_APCR_I3CPB7_PU) == (PWR_APCR_I3CPB7_PU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the pull-up on I3C1_SCL (PB8) in standby mode
  * @rmtoll APCR       I3CPB8_PU       LL_PWR_EnableI3CPB8PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableI3CPB8PU(void)
{
  SET_BIT(PWR->APCR, PWR_APCR_I3CPB8_PU);
}

/**
  * @brief  Disable the pull-up on I3C1_SCL (PB8) in standby mode
  * @rmtoll APCR       I3CPB8_PU       LL_PWR_DisableI3CPB8PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableI3CPB8PU(void)
{
  CLEAR_BIT(PWR->APCR, PWR_APCR_I3CPB8_PU);
}

/**
  * @brief  Check if the pull-up on I3C1_SCL (PB8) in standby mode is enabled
  * @rmtoll APCR       I3CPB8_PU       LL_PWR_IsEnabledI3CPB8PU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledI3CPB8PU(void)
{
  return ((READ_BIT(PWR->APCR, PWR_APCR_I3CPB8_PU) == (PWR_APCR_I3CPB8_PU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the pull-up on I3C1_SDA (PB9) in standby mode
  * @rmtoll APCR       I3CPB9_PU       LL_PWR_EnableI3CPB9PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnableI3CPB9PU(void)
{
  SET_BIT(PWR->APCR, PWR_APCR_I3CPB9_PU);
}

/**
  * @brief  Disable the pull-up on I3C1_SDA (PB9) in standby mode
  * @rmtoll APCR       I3CPB9_PU       LL_PWR_DisableI3CPB9PU
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisableI3CPB9PU(void)
{
  CLEAR_BIT(PWR->APCR, PWR_APCR_I3CPB9_PU);
}

/**
  * @brief  Check if the pull-up on I3C1_SDA (PB9) in standby mode is enabled
  * @rmtoll APCR       I3CPB9_PU       LL_PWR_IsEnabledI3CPB9PU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledI3CPB9PU(void)
{
  return ((READ_BIT(PWR->APCR, PWR_APCR_I3CPB9_PU) == (PWR_APCR_I3CPB9_PU)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the pull-up and pull-down configuration
  * @rmtoll APCR          APC           LL_PWR_EnablePUPDConfig
  * @retval None
  */
__STATIC_INLINE void LL_PWR_EnablePUPDConfig(void)
{
  SET_BIT(PWR->APCR, PWR_APCR_APC);
}

/**
  * @brief  Disable the pull-up and pull-down configuration
  * @rmtoll APCR          APC           LL_PWR_DisablePUPDConfig
  * @retval None
  */
__STATIC_INLINE void LL_PWR_DisablePUPDConfig(void)
{
  CLEAR_BIT(PWR->APCR, PWR_APCR_APC);
}

/**
  * @brief  Check if the pull-up and pull-down configuration is enabled.
  * @rmtoll APCR          APC           LL_PWR_IsEnabledPUPDConfig
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPUPDConfig(void)
{
  return ((READ_BIT(PWR->APCR, PWR_APCR_APC) == (PWR_APCR_APC)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIO N pull-up in Standby mode
  * @rmtoll PUCRN        PUx        LL_PWR_EnableGPIONPullUp
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_6
  *         @arg @ref LL_PWR_GPIO_PIN_12
  * @retval None.
  */
__STATIC_INLINE void LL_PWR_EnableGPIONPullUp(uint32_t GPIOPin)
{
  SET_BIT(PWR->PUCRN, GPIOPin);
}

/**
  * @brief  Disable GPIO N pull-up in Standby mode
  * @rmtoll PUCRN        PUx        LL_PWR_DisableGPIONPullUp
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_6
  *         @arg @ref LL_PWR_GPIO_PIN_12
  * @retval None.
  */
__STATIC_INLINE void LL_PWR_DisableGPIONPullUp(uint32_t GPIOPin)
{
  CLEAR_BIT(PWR->PUCRN, GPIOPin);
}

/**
  * @brief  Check if GPIO pull-up in Standby mode is enabled
  * @rmtoll PUCRN        PUx        LL_PWR_IsEnabledGPIONPullUp
  * @param  GPIOPin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_6
  *         @arg @ref LL_PWR_GPIO_PIN_12
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledGPIONPullUp(uint32_t GPIOPin)
{
  return ((READ_BIT(PWR->PUCRN, GPIOPin) == (GPIOPin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIO O pull-up in Standby mode
  * @rmtoll PUCRO        PUx        LL_PWR_EnableGPIOOPullUp
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_GPIO_PIN_0
  *         @arg @ref LL_PWR_GPIO_PIN_1
  *         @arg @ref LL_PWR_GPIO_PIN_4

